#+TITLE: Amazon State Language
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t
#+HTML_HEAD: <link rel="stylesheet" href="//writ.cmcenroe.me/1.0.4/writ.min.css" type="text/css">

* Language specification

https://states-language.net

* Validating State Machine locally

#+begin_src sh
❯ asl-validator --json-path state-machine-example.asl.json
#+end_src

#+RESULTS:
#+begin_example
✓ State machine definition is valid
#+end_example
